app/views/people/show.html.erb

<ul>
  <% @person.phone_numbers.each do |phone| %>
---
SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."person_id" = 1