app/controllers/phone_numbers_controller.rb

  def index
    @phone_numbers = PhoneNumber.all
---
SELECT "phone_numbers".* FROM "phone_numbers"

  def show
    @phone_number = PhoneNumber.find(params[:id])
---
SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @phone_number = PhoneNumber.find(params[:id])
---
SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @phone_number = PhoneNumber.new(params[:phone_number])

    respond_to do |format|
      if @phone_number.save
---
INSERT INTO "phone_numbers" ("created_at", "number", "person_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 18 Jun 2013 17:25:08 UTC +00:00], ["number", "MyString"], ["person_id", nil], ["updated_at", Tue, 18 Jun 2013 17:25:08 UTC +00:00]]

  def update
    @phone_number = PhoneNumber.find(params[:id])

    respond_to do |format|
      if @phone_number.update_attributes(params[:phone_number])
---
SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "phone_numbers" SET "number" = '7890123456', "updated_at" = '2013-06-18 22:30:22.706349' WHERE "phone_numbers"."id" = 1

  def destroy
    @phone_number = PhoneNumber.find(params[:id])
    @phone_number.destroy
---
SELECT "phone_numbers".* FROM "phone_numbers" WHERE "phone_numbers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "phone_numbers" WHERE "phone_numbers"."id" = ?  [["id", 1]]